rust-implementation/expor-hub-server/load-tests/artillery-api-routes-final.yml
config:
    target: https://api.exporhub.com:9000
    tls:
        rejectUnauthorized: false
    phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 5
          name: Warm up phase
        - duration: 60
          arrivalRate: 10
          rampTo: 20
          name: Ramp up load
        - duration: 30
          arrivalRate: 30
          rampTo: 60
          name: Spike phase
    plugins:
        expect:
            reportFailuresAsErrors: true
            outputFormat: prettyError
            useOnlyRequestNames: true
        ensure:
          thresholds:
            - http.response_time.p95: 800
            - http.response_time.p99: 1000
        metrics-by-endpoint:
          metricsNamespace: plugins.metrics-by-endpoint
          useOnlyRequestNames: true

scenarios:
    - flow:
          - loop:
                - get:
                      url: "/api/"
                      name: "GET /api/"
                      expect:
                          statusCode: 200
                - get:
                      url: "/api/users"
                      name: "GET /api/users"
                      expect:
                          statusCode: 200
                - get:
                      url: "/api/projects"
                      name: "GET /api/projects"
                      expect:
                          statusCode: 200
                - get:
                      url: "/api/images"
                      name: "GET /api/images"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/follows"
                      name: "GET /api/follows"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/favourites"
                      name: "GET /api/favourites"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/comments"
                      name: "GET /api/comments"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/replies"
                      name: "GET /api/replies"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/threads"
                      name: "GET /api/threads"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/likes"
                      name: "GET /api/likes"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/dislikes"
                      name: "GET /api/dislikes"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/comment-likes"
                      name: "GET /api/comment-likes"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/comment-dislikes"
                      name: "GET /api/comment-dislikes"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/reply-likes"
                      name: "GET /api/reply-likes"
                      expect:
                        statusCode: 200
                - get:
                      url: "/api/reply-dislikes"
                      name: "GET /api/reply-dislikes"
                      expect:
                        statusCode: 200
            count: 10